app/views/category/index.xml.erb

    <category id="<%= category.id %>" name="<%= category.name %>" iurl="<%= category.url_icon %>" >
        <% category.wallpapers.each do |wallpaper| %>
---
SELECT "wallpapers".* FROM "wallpapers"  WHERE "wallpapers"."category_id" = $1  ORDER BY updated_at DESC  [["category_id", 1]]