app/controllers/category_controller.rb

SELECT "categories".* FROM "categories"  WHERE (application_id = '1' AND (select count(1) FROM wallpapers where category_id = id) > 0)  ORDER BY name
---
  def index

    @categories = Category.all.order('name')