app/controllers/wallpaper_controller.rb

SELECT  "wallpapers".* FROM "wallpapers"  WHERE (category_id = '1')  ORDER BY created_at LIMIT 50
---
  def index
    @wallpapers = Wallpaper.where('category_id = ?', params[:id]).order('created_at').offset(params[:page]).limit(50)